package com.nathaniel.rxharmony.reflex;

public interface BaseView {
    /**
     * --------------------------------------------*
     * 接口开始情况  这时我们可以显示 菊花圈 或显示下载进度条
     * -------------------------------------------
     */
    void showLoading(boolean displayed);

    /**
     * --------------------------------------------*
     * 接口请求完毕  这时我们可以  将菊花圈隐藏掉 或下载进度条隐藏掉
     * -------------------------------------------
     */
    void hideLoading();

    /**
     * --------------------------------------------*
     * 返回 非定义的code状态码，和msg  mType 区分异常时请求的接口是哪个
     * -------------------------------------------
     */
    void onErrorState(String message);
}
